                org 7C00h
start:
; Инициализируем сегменты
                mov             ax,cs
                mov             ds,ax
                mov             es,ax
                mov             ss,ax
                xor             sp,sp
; Очищаем экран
                mov             ax,3
                int             10h
; Загружаем шрифт
                mov             ax,1110h
                mov             cx,11               ; Число знаков
                mov             dx,160              ; Смещение на символ.
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, font
                int             10h
; Загружаем псевдографику
                mov             ax,1110h
                mov             cx,4                ; Число знаков
                mov             dx,0B0h             ; Смещение на символ. Псевдографика B0-DF
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, graph
                int             10h

; Выводим текст
                push            0b800h              ; Сегмент текстового режима заносим в ES
                pop             es
                mov             di,(80-40)          ; Смещение на позицию на экране
                mov             si, fio             ; Смещение на выводимую строку
                mov             ah,44               ; Цвет
m1:
                lodsb
                or              al,al               ; Повторяем пока очередной символ не станет равным нулю
                stosw
                jnz             m1
; Выводим треугольник
                mov             di,160 * 23 + (80 - 4) ; Смещение на позицию на экране
                mov             si, ellipce         ; Смещение на выводимую строку
                mov             cx,4                ; Число символов
                mov             ah,15
m2:
                lodsb
                stosw
                loop            m2
                xor             ax,ax               ; Ожидаем нажатия клавиши
                int             16h

; Здесь должна начать работу операционная система...          
; Сабельников Филипп Андреевич НМТ-393907
fio             db              "C"
                db              "a"
                db              160 ; "б"
                db              "e"
                db              165 ; "л"
                db              169 ; "ь"
                db              166 ; "н"
                db              163 ; "и"
                db              164 ; "к"
                db              "o"
                db              161 ; "в"
                db              " "
                db              170 ; "Ф"
                db              163 ; "и"
                db              165 ; "л"
                db              163 ; "и"
                db              167 ; "п"
                db              167 ; "п"
                db              " "
                db              "A"
                db              166 ; "н"
                db              162 ; "д"
                db              "p"
                db              "e"
                db              "e"
                db              161 ; "в"
                db              163 ; "и"
                db              168 ; "ч"
                                db              " HMT-393907"
                db              0
ellipce db             0b0h,0b1h,0b2h,0b3h
font:
rus_b   db 000,002,006,060,096,096,124,102,102,102,102,060,000,000,000,000 ; 160
rus_v   db 000,000,000,000,000,252,102,102,124,102,102,252,000,000,000,000 ; 161
rus_d   db 000,000,000,000,000,030,054,054,102,102,102,255,195,195,000,000 ; 162   
rus_i   db 000,000,000,000,000,198,198,206,214,230,198,198,000,000,000,000 ; 163
rus_k   db 000,000,000,000,000,230,108,120,120,108,102,230,000,000,000,000 ; 164
rus_l   db 000,000,000,000,000,030,054,102,102,102,102,102,000,000,000,000 ; 165
rus_n   db 000,000,000,000,000,198,198,198,254,198,198,198,000,000,000,000 ; 166
rus_p   db 000,000,000,000,000,254,198,198,198,198,198,198,000,000,000,000 ; 167
rus_ch  db 000,000,000,000,000,198,198,198,198,126,006,006,000,000,000,000 ; 168
rus_ss  db 000,000,000,000,000,198,198,198,246,222,222,246,000,000,000,000 ; 169
rus_F   db 000,060,024,126,219,219,219,219,219,126,024,060,000,000,000,000 ; 170

graph:
                db              00000000b       ; B0
                db              00000000b
                db              00000001b
                db              00000110b
                db              00001000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00001000b
                db              00000110b
                db              00000001b
                db              00000000b
                db              00000000b
                db              00000000b

                db              00000000b
                db              01111111b
                db              10000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              10000000b
                db              01111111b
                db              00000000b
                db              00000000b

                db              00000000b
                db              11111110b
                db              00000001b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000001b
                db              11111110b
                db              00000000b
                db              00000000b

                db              00000000b
                db              00000000b
                db              10000000b
                db              01100000b
                db              00010000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00010000b
                db              01100000b
                db              10000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              510-($-$$) dup 0 ; Нули для заполнения остатков до конца сектора
                
                dw              0AA55h  ; Признак загрузочного сектора
